Pandas generally provide two data structure for manipulating data, They are:

Series
DataFrame

In [ ]:
!pip install pandas

In [1]:
import pandas as pd  
import numpy as np  
info = np.array(['P','a','n','d','a','s'])  
a = pd.Series(info)  
print(a)

0    P
1    a
2    n
3    d
4    a
5    s
dtype: object

# Series
Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index.

pandas.Series
A pandas Series can be created using the following constructor −

pandas.Series( data, index, dtype, copy)
The parameters of the constructor are as follows −

# Dataframe
A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

Features of DataFrame
Potentially columns are of different types
Size – Mutable
Labeled axes (rows and columns)
Can Perform Arithmetic operations on rows and columns

In [2]:
import pandas as pd  
# a list of strings  
x = ['Python', 'Pandas']  
  
# Calling DataFrame constructor on list  
df = pd.DataFrame(x)  
print(df)

        0
0  Python
1  Pandas

In [4]:
#creating Empty Dataframe
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [6]:
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
print(df)

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [7]:
# Creating the dictionaries of lists

import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [19]:
import pandas as pd
import numpy as np

#Create a series with 100 random numbers
s = pd.Series(np.random.randn(4))
print(s)

0   -0.692370
1   -0.632993
2   -0.608573
3   -0.490093
dtype: float64

In [22]:
df1=pd.read_csv("./motor.csv")
df1

    S/no  times  accel  strata      v
0      1    2.4    0.0       1    3.7
1      2    2.6   -1.3       1    3.7
2      3    3.2   -2.7       1    3.7
3      4    3.6    0.0       1    3.7
4      5    4.0   -2.7       1    3.7
..   ...    ...    ...     ...    ...
89   128   52.0   10.7       3  138.0
90   129   53.2  -14.7       3  138.0
91   130   55.0   -2.7       3  138.0
92   132   55.4   -2.7       3  138.0
93   133   57.6   10.7       3  138.0

[94 rows x 5 columns]

In [25]:
df1.head()

   S/no  times  accel  strata    v
0     1    2.4    0.0       1  3.7
1     2    2.6   -1.3       1  3.7
2     3    3.2   -2.7       1  3.7
3     4    3.6    0.0       1  3.7
4     5    4.0   -2.7       1  3.7
5     6    6.2   -2.7       1  3.7
6     7    6.6   -2.7       1  3.7
7     8    6.8   -1.3       1  3.7
8     9    7.8   -2.7       1  3.7
9    10    8.2   -2.7       1  3.7

In [26]:
df1.tail()

    S/no  times  accel  strata      v
89   128   52.0   10.7       3  138.0
90   129   53.2  -14.7       3  138.0
91   130   55.0   -2.7       3  138.0
92   132   55.4   -2.7       3  138.0
93   133   57.6   10.7       3  138.0

In [27]:
df1.mean()

S/no       68.946809
times      25.900000
accel     -21.784043
strata      1.989362
v         418.062766
dtype: float64

In [28]:
df1.median()

S/no       71.5
times      24.8
accel      -2.7
strata      2.0
v         607.0
dtype: float64

In [29]:
df1.mode()

    S/no  times  accel  strata      v
0      1    2.4   -2.7     2.0  607.0
1      2    2.6    NaN     NaN    NaN
2      3    3.2    NaN     NaN    NaN
3      4    3.6    NaN     NaN    NaN
4      5    4.0    NaN     NaN    NaN
..   ...    ...    ...     ...    ...
89   128   52.0    NaN     NaN    NaN
90   129   53.2    NaN     NaN    NaN
91   130   55.0    NaN     NaN    NaN
92   132   55.4    NaN     NaN    NaN
93   133   57.6    NaN     NaN    NaN

[94 rows x 5 columns]

In [32]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 94 entries, 0 to 93
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   S/no    94 non-null     int64
 1   times   94 non-null     float64
 2   accel   94 non-null     float64
 3   strata  94 non-null     int64
 4   v       94 non-null     float64
dtypes: float64(3), int64(2)
memory usage: 3.8 KB

In [33]:
df1.describe()

             S/no     times       accel     strata           v
count   94.000000  94.00000   94.000000  94.000000   94.000000
mean    68.946809  25.90000  -21.784043   1.989362  418.062766
std     40.496480  13.95485   50.585489   0.595587  261.331104
min      1.000000   2.40000 -134.000000   1.000000    3.700000
25%     33.500000  15.65000  -42.225000   2.000000  138.000000
50%     71.500000  24.80000   -2.700000   2.000000  607.000000
75%    102.500000  35.35000    0.000000   2.000000  607.000000
max    133.000000  57.60000   75.000000   3.000000  607.000000

In [34]:
df1.var()

S/no       1639.964882
times       194.737849
accel      2558.891678
strata        0.354724
v         68293.945803
dtype: float64

In [36]:
df1.skew()

S/no     -0.167698
times     0.343848
accel    -0.698022
strata    0.002754
v        -0.707614
dtype: float64

In [37]:
df1.kurtosis()

S/no     -1.225283
times    -0.664419
accel    -0.072044
strata   -0.093141
v        -1.433667
dtype: float64

In [38]:
df1.count() # it will count all the non- null vallues

S/no      94
times     94
accel     94
strata    94
v         94
dtype: int64

In [39]:
df1.max()

S/no      133.0
times      57.6
accel      75.0
strata      3.0
v         607.0
dtype: float64

In [40]:
df1.min()

S/no        1.0
times       2.4
accel    -134.0
strata      1.0
v           3.7
dtype: float64

In [41]:
df1.columns

Index(['S/no', 'times', 'accel', 'strata', 'v'], dtype='object')

In [48]:
df2=df1.dropna() # to drop the null values
df2

    S/no  times  accel  strata      v
0      1    2.4    0.0       1    3.7
1      2    2.6   -1.3       1    3.7
2      3    3.2   -2.7       1    3.7
3      4    3.6    0.0       1    3.7
4      5    4.0   -2.7       1    3.7
..   ...    ...    ...     ...    ...
89   128   52.0   10.7       3  138.0
90   129   53.2  -14.7       3  138.0
91   130   55.0   -2.7       3  138.0
92   132   55.4   -2.7       3  138.0
93   133   57.6   10.7       3  138.0

[94 rows x 5 columns]

In [49]:
df1.dropna(axis= 1) #It drops all the columns that contain null values.

    S/no  times  accel  strata      v
0      1    2.4    0.0       1    3.7
1      2    2.6   -1.3       1    3.7
2      3    3.2   -2.7       1    3.7
3      4    3.6    0.0       1    3.7
4      5    4.0   -2.7       1    3.7
..   ...    ...    ...     ...    ...
89   128   52.0   10.7       3  138.0
90   129   53.2  -14.7       3  138.0
91   130   55.0   -2.7       3  138.0
92   132   55.4   -2.7       3  138.0
93   133   57.6   10.7       3  138.0

[94 rows x 5 columns]

In [56]:
df.fillna(100) # It replaces all null values with x.

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [57]:
df1.corr()

            S/no     times     accel    strata         v
S/no    1.000000  0.976766  0.190150  0.843012  0.202687
times   0.976766  1.000000  0.244541  0.870815  0.072406
accel   0.190150  0.244541  1.000000  0.026202 -0.316992
strata  0.843012  0.870815  0.026202  1.000000  0.177075
v       0.202687  0.072406 -0.316992  0.177075  1.000000